rainer20512/stm32-fw/Src/debug_pwr_rcc.c
/**
  ******************************************************************************
  * @file    debug_util.c
  * @author  Rainer
  * @brief   Miscellaneous tools for debug output
  *
  ******************************************************************************
  *
  ******************************************************************************
  */

/** @addtogroup DEBUG_UTILS
  * @{
  */

#include "debug.h"

#if DEBUG_FEATURES > 0

#include "stm32l4xx.h"

#include <stdarg.h>
#include <stdio.h>
#include <string.h>

#include "debug_helper.h"
#include "rtc.h"


/*
 *************************************************************
 * local helper functions 
 *************************************************************
 */


/*
 *************************************************************
 * Functions to dump PWR settings
 *************************************************************
 */

const char * const vos_txt[]={"Illegal","Range 1: 1.2V","Range 2: 1.0V","Illegal"};
static const char* DBG_get_pwr_cr1_vos_txt(uint32_t sel)
{
  if ( sel < sizeof(vos_txt)/sizeof(char *) ) 
    return vos_txt[sel];
  else
    return "Illegal";
}

const char * const lpms_txt[]={"Stop 0", "Stop 1", "Stop 2", "Standby" };
static const char* DBG_get_pwr_cr1_lpms_txt(uint32_t sel)
{
  if ( sel > 3 )  return "Shutdown";
    
  return lpms_txt[sel];
}

const char * const pls_txt[]={"2.0V", "2.2V", "2.4V", "2.5V", "2.6V", "2.8V", "2.9V", "PB7 Ain" };
static const char* DBG_get_pwr_cr2_pls_txt(uint32_t sel)
{
  if ( sel < sizeof(pls_txt)/sizeof(char *) ) 
    return pls_txt[sel];
  else
    return "Illegal";
}


static void DBG_dump_pwr_cr1(void)
{
  DBG_setPadLen(24);
  DBG_dump_textvalue("LP Run Mode", READ_BIT(PWR->CR1, PWR_CR1_LPR) ? "LowPower Mode" : "Main Mode" );    
  DBG_dump_textvalue("Vcore value", DBG_get_pwr_cr1_vos_txt(( PWR->CR1 & PWR_CR1_VOS_Msk  ) >> PWR_CR1_VOS_Pos) );
  DBG_dump_bitvalue("Disable BkUp Wr Protect ", PWR->CR1, PWR_CR1_DBP);
  DBG_dump_textvalue("Low power Mode", DBG_get_pwr_cr1_lpms_txt(( PWR->CR1 & PWR_CR1_LPMS_Msk  ) >> PWR_CR1_LPMS_Pos) );
}

static void DBG_dump_pwr_cr2(void)
{
  DBG_setPadLen(24);
  DBG_dump_bitvalue("VddUSB on", PWR->CR2, PWR_CR2_USV);
  DBG_dump_bitvalue("VddIO2 on", PWR->CR2, PWR_CR2_IOSV);
  DBG_dump_bitvalue("VddA  2.20V monitor", PWR->CR2, PWR_CR2_PVME4);
  DBG_dump_bitvalue("VddA  1.62V monitor", PWR->CR2, PWR_CR2_PVME3);
  DBG_dump_bitvalue("VddIO2 0.9V monitor", PWR->CR2, PWR_CR2_PVME2);
  DBG_dump_bitvalue("VddUSB 1.2V monitor", PWR->CR2, PWR_CR2_PVME1);
  DBG_dump_textvalue("Pwr voltage detect lvl", DBG_get_pwr_cr2_pls_txt(( PWR->CR2 & PWR_CR2_PLS_Msk  ) >> PWR_CR2_PLS_Pos) );
  DBG_dump_bitvalue("Voltage detect enable", PWR->CR2, PWR_CR2_PVDE);
}

static void DBG_dump_pwr_cr3(void)
{
  DBG_setPadLen(24);
  DBG_dump_bitvalue("Internal WakeUp enabled", PWR->CR3, PWR_CR3_EIWUL);
  DBG_dump_bitvalue("Apply GPIO PU/PD", PWR->CR3, PWR_CR3_APC);
  DBG_dump_onoffvalue("SRAM2 pwr in Standby", PWR->CR3, PWR_CR3_RRS);
  DBG_dump_bitvalue("Enable WakeUp Pin5", PWR->CR3, PWR_CR3_EWUP5);
  DBG_dump_bitvalue("Enable WakeUp Pin4", PWR->CR3, PWR_CR3_EWUP4);
  DBG_dump_bitvalue("Enable WakeUp Pin3", PWR->CR3, PWR_CR3_EWUP3);
  DBG_dump_bitvalue("Enable WakeUp Pin2", PWR->CR3, PWR_CR3_EWUP2);
  DBG_dump_bitvalue("Enable WakeUp Pin1", PWR->CR3, PWR_CR3_EWUP1);
}

static void DBG_dump_pwr_cr4(void)
{
  DBG_setPadLen(24);
  DBG_dump_uint32_hex("PWR->CR4 raw", PWR->CR4);
}
 
static void DBG_dump_pwr_sr1(void)
{
  DBG_setPadLen(24);
  DBG_dump_bitvalue("Wkup Flag Internal", PWR->SR1, PWR_SR1_WUFI);
  DBG_dump_bitvalue("Standby Flag", PWR->SR1, PWR_SR1_SBF);
  DBG_dump_bitvalue("Wkup Flag 5", PWR->SR1, PWR_SR1_WUF5);
  DBG_dump_bitvalue("Wkup Flag 4", PWR->SR1, PWR_SR1_WUF4);
  DBG_dump_bitvalue("Wkup Flag 3", PWR->SR1, PWR_SR1_WUF3);
  DBG_dump_bitvalue("Wkup Flag 2", PWR->SR1, PWR_SR1_WUF2);
  DBG_dump_bitvalue("Wkup Flag 1", PWR->SR1, PWR_SR1_WUF1);
}

static void DBG_dump_pwr_sr2(void)
{
  DBG_setPadLen(24);
  if ( PWR->CR2 & PWR_CR2_PVME4 )   DBG_dump_bitvalue("VddA < 2.20V", PWR->SR2, PWR_SR2_PVMO4);
  if ( PWR->CR2 & PWR_CR2_PVME3 )   DBG_dump_bitvalue("VddA < 1.62V", PWR->SR2, PWR_SR2_PVMO3);
  if ( PWR->CR2 & PWR_CR2_PVME2 )   DBG_dump_bitvalue("VddIO2 < 0.9V", PWR->SR2, PWR_SR2_PVMO2);
  if ( PWR->CR2 & PWR_CR2_PVME1 )   DBG_dump_bitvalue("VddUSB < 1.2V", PWR->SR2, PWR_SR2_PVMO1);
  if ( PWR->CR2 & PWR_CR2_PVDE )    DBG_dump_bitvalue("Vdd < Threshold", PWR->SR2, PWR_SR2_PVDO);
  DBG_dump_bitvalue("Vcore reg. in transit", PWR->SR2, PWR_SR2_VOSF);
  DBG_dump_bitvalue("Vcore reg. LP mode", PWR->SR2, PWR_SR2_REGLPF);
  DBG_dump_bitvalue("LP reg. ready", PWR->SR2, PWR_SR2_REGLPS);
}

void DBG_dump_powersetting(void)
{
  DEBUG_PUTS("PWR Settings ------------------------------------" );
  int oldIndent = DBG_setIndentRel(+2);

  /********  PWR Control registers *****************/
  DBG_printf_indent("PWR: Power Control Register 1 \n" );
  DBG_setIndentRel(+2);
  DBG_dump_pwr_cr1();
  DBG_setIndentRel(-2);

  DBG_printf_indent("PWR: Power Control Register 2 \n" );
  DBG_setIndentRel(+2);
  DBG_dump_pwr_cr2();
  DBG_setIndentRel(-2);

  DBG_printf_indent("PWR: Power Control Register 3 \n" );
  DBG_setIndentRel(+2);
  DBG_dump_pwr_cr3();
  DBG_setIndentRel(-2);

  DBG_printf_indent("PWR: Power Control Register 4 \n" );
  DBG_setIndentRel(+2);
  DBG_dump_pwr_cr4();
  DBG_setIndentRel(-2);

  /********  PWR Status registers *****************/
  DBG_printf_indent("PWR: Power Status Register 1 \n" );
  DBG_setIndentRel(+2);
  DBG_dump_pwr_sr1();
  DBG_setIndentRel(-2);

  DBG_printf_indent("PWR: Power Status Register 2 \n" );
  DBG_setIndentRel(+2);
  DBG_dump_pwr_sr2();
  DBG_setIndentRel(-2);

  DBG_setIndentAbs(oldIndent);
}



/*
 *************************************************************
 * Functions to dump RCC settings
 *************************************************************
 */


const char * const msirange_txt[]={"100kHz", "200kHz", "400kHz", "800kHz",
                            "1MHz", "2MHz", "4MHz", "8MHz", "16MHz", "24MHz", "32MHz", "48MHz" };
static const char* DBG_get_msirange_text ( uint32_t sel, uint32_t msirgsel )
{
  if ( msirgsel ) {
    // full range 
    if ( sel < sizeof(msirange_txt)/sizeof(char *) ) 
      return msirange_txt[sel];
    else
      return "Illegal";
  } else {
    // restricted range after Reset/Standby
    if ( sel >=4 && sel < 8  ) 
      return msirange_txt[sel];
    else
      return "Illegal";

