rainer20512/stm32-fw/Src/debug_pwr_rcc.c
  DBG_setPadLen(16);
  DBG_dump_number("SYSCLK", HAL_RCC_GetSysClockFreq() );
  DBG_dump_number("HCLK",  HAL_RCC_GetHCLKFreq());
  DBG_dump_number("PCLK1",  HAL_RCC_GetPCLK1Freq());
  DBG_dump_number("PCLK2",  HAL_RCC_GetPCLK2Freq());
  HAL_RCC_GetClockConfig(&v, &f_latency);
  DBG_dump_textvalue("Vcore value", DBG_get_pwr_cr1_vos_txt(( PWR->CR1 & PWR_CR1_VOS_Msk  ) >> PWR_CR1_VOS_Pos) );
  DBG_dump_number("Flash Latency", f_latency);  
}


void DBG_dump_clocksetting(void)
{
  DEBUG_PUTS("RCC Settings ------------------------------------" );
  int oldIndent = DBG_setIndentRel(+2);

  /********  Clock Control register *****************/
  DBG_printf_indent("RCC: Clock Control Register\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_cr();
  DBG_setIndentRel(-2);

  /********  Backup Domain Control register *****************/
  DBG_printf_indent("RCC: Backup Domain Control Register\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_bdcr();
  DBG_setIndentRel(-2);

  /********  MSI/HSI calibration register *****************/
  if (  READ_BIT(RCC->CR, RCC_CR_MSION) || READ_BIT(RCC->CR, RCC_CR_HSION ) ) {
    DBG_printf_indent("RCC: MSI/HSI Calibration Register\n" );
    DBG_setIndentRel(+2);
    DBG_dump_rcc_icscr();
    DBG_setIndentRel(-2);
  }

  /******** Clock configuration register *****************/
  DBG_printf_indent("RCC: Clock configuration register\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_cfgr();
  DBG_setIndentRel(-2);

  /******** PLL configuration register *****************/
  DBG_printf_indent("RCC: PLL configuration register\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_pllcfgr();
  DBG_setIndentRel(-2);


  /******** System Clocks *****************/
  DBG_printf_indent("Resulting System Clocks\n" );
  DBG_setIndentRel(+2);
  DBG_dump_clocks();
  DBG_setIndentRel(-2);


  DBG_setIndentAbs(oldIndent);
}

/*
 *************************************************************
 * Functions to dump peripheral clock settings
 *************************************************************
 */

/*
 *************************************************************
 * The follwowing routines are used to dump ordinary and
 * sleep mode register settings, so the register is passed as 
 * parameter. This only works, because bit positions in 
 * ordinary and sleep mode registers are identical
 *************************************************************
 */
void DBG_dump_rcc_ahbenr(uint32_t reg1, uint32_t reg2, uint32_t reg3, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "AHB1SMENR raw " : "AHB1ENR raw ", reg1 );  
  DBG_dump_uint32_hex(bSleepRegisters ? "AHB2SMENR raw " : "AHB2ENR raw ", reg2 );  
  DBG_dump_uint32_hex(bSleepRegisters ? "AHB3SMENR raw " : "AHB3ENR raw ", reg3 );  

  DBG_dump_onoffvalue  ("TSC Clock",   reg1, RCC_AHB1ENR_TSCEN);  
  DBG_dump_onoffvalue  ("CRC Clock",   reg1, RCC_AHB1ENR_CRCEN);  
  if ( bSleepRegisters)   DBG_dump_onoffvalue  ("SRAM1 Clock", reg1, RCC_AHB1SMENR_SRAM1SMEN);  
  DBG_dump_onoffvalue  ("Flash Clock", reg1, RCC_AHB1ENR_FLASHEN);  
  DBG_dump_onoffvalue  ("DMA2 Clock",  reg1, RCC_AHB1ENR_DMA2EN);  
  DBG_dump_onoffvalue  ("DMA1 Clock",  reg1, RCC_AHB1ENR_DMA1EN);  

  DBG_dump_onoffvalue  ("RNG Clock",  reg2, RCC_AHB2ENR_RNGEN);  
  DBG_dump_onoffvalue  ("ADC Clock",  reg2, RCC_AHB2ENR_ADCEN);  
  DBG_dump_onoffvalue  ("OTGFS Clock",  reg2, RCC_AHB2ENR_OTGFSEN);  
  if ( bSleepRegisters)   DBG_dump_onoffvalue  ("SRAM2 Clock", reg2, RCC_AHB2SMENR_SRAM2SMEN);  
  DBG_dump_onoffvalue  ("GPIOH Clock",  reg2, RCC_AHB2ENR_GPIOHEN);  
  DBG_dump_onoffvalue  ("GPIOG Clock",  reg2, RCC_AHB2ENR_GPIOGEN);  
  DBG_dump_onoffvalue  ("GPIOF Clock",  reg2, RCC_AHB2ENR_GPIOFEN);  
  DBG_dump_onoffvalue  ("GPIOE Clock",  reg2, RCC_AHB2ENR_GPIOEEN);  
  DBG_dump_onoffvalue  ("GPIOD Clock",  reg2, RCC_AHB2ENR_GPIODEN);  
  DBG_dump_onoffvalue  ("GPIOC Clock",  reg2, RCC_AHB2ENR_GPIOCEN);  
  DBG_dump_onoffvalue  ("GPIOB Clock",  reg2, RCC_AHB2ENR_GPIOBEN);  
  DBG_dump_onoffvalue  ("GPIOA Clock",  reg2, RCC_AHB2ENR_GPIOAEN);  

  DBG_dump_onoffvalue  ("QSPI Clock",  reg3, RCC_AHB3ENR_QSPIEN);  
  DBG_dump_onoffvalue  ("FMC Clock",  reg3, RCC_AHB3ENR_FMCEN);  


}

void DBG_dump_rcc_apb1enr(uint32_t reg1, uint32_t reg2, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "APB1SMENR1 raw" : "APB1ENR1 raw", reg1 );  
  DBG_dump_uint32_hex(bSleepRegisters ? "APB1SMENR2 raw" : "APB1ENR2 raw", reg2 );  

  DBG_dump_onoffvalue  ("LPTIM1 Clock", reg1, RCC_APB1ENR1_LPTIM1EN);  
  DBG_dump_onoffvalue  ("OpAmp Clock", reg1, RCC_APB1ENR1_OPAMPEN);  
  DBG_dump_onoffvalue  ("DAC1 Clock", reg1, RCC_APB1ENR1_DAC1EN);  
  DBG_dump_onoffvalue  ("PWR Clock", reg1, RCC_APB1ENR1_PWREN);  
  DBG_dump_onoffvalue  ("CAN1 Clock", reg1, RCC_APB1ENR1_CAN1EN);  
  DBG_dump_onoffvalue  ("I2C3 Clock", reg1, RCC_APB1ENR1_I2C3EN);  
  DBG_dump_onoffvalue  ("I2C2 Clock", reg1, RCC_APB1ENR1_I2C2EN);  
  DBG_dump_onoffvalue  ("I2C1 Clock", reg1, RCC_APB1ENR1_I2C1EN);  
  DBG_dump_onoffvalue  ("UART5 Clock", reg1, RCC_APB1ENR1_UART5EN);  
  DBG_dump_onoffvalue  ("UART4 Clock", reg1, RCC_APB1ENR1_UART4EN);  
  DBG_dump_onoffvalue  ("USART3 Clock", reg1, RCC_APB1ENR1_USART3EN);  
  DBG_dump_onoffvalue  ("USART2 Clock", reg1, RCC_APB1ENR1_USART2EN);  
  DBG_dump_onoffvalue  ("SPI3 Clock", reg1, RCC_APB1ENR1_SPI3EN);  
  DBG_dump_onoffvalue  ("SPI2 Clock", reg1, RCC_APB1ENR1_SPI2EN);  
  DBG_dump_onoffvalue  ("WWDG Clock", reg1, RCC_APB1ENR1_WWDGEN);  
  DBG_dump_onoffvalue  ("LCD Clock", reg1, RCC_APB1ENR1_LCDEN);  
  DBG_dump_onoffvalue  ("TIM7 Clock", reg1, RCC_APB1ENR1_TIM7EN);  
  DBG_dump_onoffvalue  ("TIM6 Clock", reg1, RCC_APB1ENR1_TIM6EN);  
  DBG_dump_onoffvalue  ("TIM5 Clock", reg1, RCC_APB1ENR1_TIM5EN);  
  DBG_dump_onoffvalue  ("TIM4 Clock", reg1, RCC_APB1ENR1_TIM4EN);  
  DBG_dump_onoffvalue  ("TIM3 Clock", reg1, RCC_APB1ENR1_TIM3EN);  
  DBG_dump_onoffvalue  ("TIM2 Clock", reg1, RCC_APB1ENR1_TIM2EN);  

  DBG_dump_onoffvalue  ("LPTIM2 Clock", reg2, RCC_APB1ENR2_LPTIM2EN);  
  DBG_dump_onoffvalue  ("SWPMI1 Clock", reg2, RCC_APB1ENR2_SWPMI1EN);  
  DBG_dump_onoffvalue  ("LPUART1 Clock", reg2, RCC_APB1ENR2_LPUART1EN);  
} 

void DBG_dump_rcc_apb2enr(uint32_t reg, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "APB2SMENR raw" : "APB2ENR raw",reg );  
  DBG_dump_onoffvalue  ("DFSDM1 Clock", reg, RCC_APB2ENR_DFSDM1EN);  
  DBG_dump_onoffvalue  ("SAI2 Clock", reg, RCC_APB2ENR_SAI2EN);  
  DBG_dump_onoffvalue  ("SAI1 Clock", reg, RCC_APB2ENR_SAI1EN);  
  DBG_dump_onoffvalue  ("TIM17 Clock", reg, RCC_APB2ENR_TIM17EN);  
  DBG_dump_onoffvalue  ("TIM16 Clock", reg, RCC_APB2ENR_TIM16EN);  
  DBG_dump_onoffvalue  ("TIM15 Clock", reg, RCC_APB2ENR_TIM15EN);  
  DBG_dump_onoffvalue  ("USART1 Clock", reg, RCC_APB2ENR_USART1EN);  
  DBG_dump_onoffvalue  ("TIM8 Clock", reg, RCC_APB2ENR_TIM8EN);  
  DBG_dump_onoffvalue  ("SPI1 Clock", reg, RCC_APB2ENR_SPI1EN);  
  DBG_dump_onoffvalue  ("TIM1 Clock", reg, RCC_APB2ENR_TIM1EN);  
  DBG_dump_onoffvalue  ("SDMMC1 Clock", reg, RCC_APB2ENR_SDMMC1EN);  
  DBG_dump_onoffvalue  ("FW Clock", reg, RCC_APB2ENR_FWEN);  
  DBG_dump_onoffvalue  ("SYSCFG Clock", reg, RCC_APB2ENR_SYSCFGEN);  
}


void DBG_dump_peripheralclocksetting(void)
{
  DEBUG_PUTS("Peripheral Clock Settings -----------------------" );
  int oldIndent = DBG_setIndentRel(+2);

  /********  AHB peripheral clock enable register *****************/
  DBG_printf_indent("AHB peripheral clocks\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_ahbenr(RCC->AHB1ENR, RCC->AHB2ENR, RCC->AHB2ENR, 0);
  DBG_setIndentRel(-2);

  /********  APB1 peripheral clock enable register *****************/
  DBG_printf_indent("APB1 peripheral clocks\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_apb1enr(RCC->APB1ENR1, RCC->APB1ENR2,0);
  DBG_setIndentRel(-2);

  /********  APB2 peripheral clock enable register *****************/
  DBG_printf_indent("APB2 peripheral clocks\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_apb2enr(RCC->APB2ENR,0);
  DBG_setIndentRel(-2);

  /********  Backup Domain control register *****************/
  DBG_printf_indent("Backup Domain / RTC clock\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_bdcr();
  DBG_setIndentRel(-2);

  DBG_setIndentAbs(oldIndent);
}

void DBG_dump_peripheralclocksetting_insleepmode(void)
{
  DEBUG_PUTS("Peripheral Clock Settings ** IN SLEEP MODE ** ---" );
  int oldIndent = DBG_setIndentRel(+2);

  /********  AHB peripheral clock enable register *****************/
  DBG_printf_indent("AHB peripheral clocks in SleepMode\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_ahbenr(RCC->AHB1SMENR, RCC->AHB2SMENR, RCC->AHB3SMENR, 1);
  DBG_setIndentRel(-2);

  /********  APB1 peripheral clock enable register *****************/
  DBG_printf_indent("APB1 peripheral clocks in SleepMode\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_apb1enr(RCC->APB1SMENR1, RCC->APB1SMENR2, 1);
  DBG_setIndentRel(-2);

  /********  APB2 peripheral clock enable register *****************/
  DBG_printf_indent("APB2 peripheral clocks in SleepMode\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_apb2enr(RCC->APB2SMENR, 1);
  DBG_setIndentRel(-2);

  DBG_setIndentAbs(oldIndent);
}

const char * const pclk_txt[]={"APB Clk", "SYSCLK", "HSI16 Clk", "LSE clk" };
static const char* DBG_get_perip_clksrc_txt(uint32_t sel, uint32_t bSel4, uint32_t bSpecial)
{
  /* 
   * Clock Source 01 on LPTIM1 is deviating from normal bitcode schema
   * so handle specially
   */
  if ( bSpecial && sel == 1 ) return "LSI Clk";
   
  if ( sel < sizeof(pclk_txt)/sizeof(char *) - ( bSel4 ? 0 : 1 ) ) 
    return pclk_txt[sel];
  else
    return "Illegal";
}


const char * const adcclk_txt[]={"No Clock","PLLSAI1-R","PLLSAI2-R","SYSCLK"};
static const char* DBG_get_rcc_ccipr_adcclk_txt(uint32_t sel)
{
  if ( sel < sizeof(adcclk_txt)/sizeof(char *) ) 
    return adcclk_txt[sel];
  else
    return "Illegal";
}

const char *clk48_txt[]={"No Clock","PLLSAI1-Q","PLL-Q","MSI"};
static const char* DBG_get_rcc_ccipr_clk48_txt(uint32_t sel)
{
  if ( sel < sizeof(clk48_txt)/sizeof(char *) ) 
    return clk48_txt[sel];
  else
    return "Illegal";
}

