rainer20512/stm32-fw/Src/debug_pwr_rcc.c
const char *saiclk_txt[]={"PLLSAI1-P","PLLSAI2-P","PLL-P","ext.Clk"};
static const char* DBG_get_rcc_ccipr_saiclk_txt(uint32_t sel)
{
  if ( sel < sizeof(saiclk_txt)/sizeof(char *) ) 
    return saiclk_txt[sel];
  else
    return "Illegal";
}


void DBG_dump_peripheralclockconfig(void)
{
  DEBUG_PUTS("Peripheral clock configuration ------------------" );
  int oldIndent = DBG_setIndentRel(+2);
  DBG_setPadLen(18);

  if ( READ_BIT(RCC->APB2ENR, RCC_APB2ENR_DFSDM1EN ) )
    DBG_dump_textvalue("DFSDM1 Clk Source", READ_BIT(RCC->CCIPR , RCC_CCIPR_DFSDM1SEL) ? "SYSCLK" : "APB2CLK" );    
  if ( READ_BIT(RCC->APB1ENR2,RCC_APB1ENR2_SWPMI1EN ) )
    DBG_dump_textvalue("SWPMI1 Clk Source", READ_BIT(RCC->CCIPR , RCC_CCIPR_SWPMI1SEL) ? "HSI16" : "APB1CLK" );    
  if ( READ_BIT(RCC->AHB2ENR,RCC_AHB2ENR_ADCEN ) )
    DBG_dump_textvalue("ADC Clk Source", DBG_get_rcc_ccipr_adcclk_txt((RCC->CCIPR & RCC_CCIPR_ADCSEL_Msk) >> RCC_CCIPR_ADCSEL_Pos) );    

  /* CLK48 used by sdmmc, usb and rng */
  if ( READ_BIT(RCC->APB2ENR,RCC_APB2ENR_SDMMC1EN) || READ_BIT(RCC->APB2ENR, RCC_AHB2ENR_OTGFSEN) || READ_BIT(RCC->APB2ENR,RCC_AHB2ENR_RNGEN) ) 
    DBG_dump_textvalue("CLK48 Source", DBG_get_rcc_ccipr_clk48_txt((RCC->CCIPR & RCC_CCIPR_CLK48SEL_Msk) >> RCC_CCIPR_CLK48SEL_Pos) );    
  if ( READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI2EN ) )
    DBG_dump_textvalue("SAI2 Clk Source", DBG_get_rcc_ccipr_saiclk_txt((RCC->CCIPR & RCC_CCIPR_SAI2SEL_Msk) >> RCC_CCIPR_SAI2SEL_Pos) );    
  if ( READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI1EN ) )
    DBG_dump_textvalue("SAI1 Clk Source", DBG_get_rcc_ccipr_saiclk_txt((RCC->CCIPR & RCC_CCIPR_SAI1SEL_Msk) >> RCC_CCIPR_SAI1SEL_Pos) );    

  if ( READ_BIT(RCC->APB1ENR2, RCC_APB1ENR2_LPTIM2EN ) )
       DBG_dump_textvalue("LPTIM2Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_LPTIM2SEL_Msk) >> RCC_CCIPR_LPTIM2SEL_Pos,1,1) ); 
  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_LPTIM1EN ) )
       DBG_dump_textvalue("LPTIM1Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_LPTIM1SEL_Msk) >> RCC_CCIPR_LPTIM1SEL_Pos,1,1) ); 

  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C3EN ) )
       DBG_dump_textvalue("I2C3 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_I2C3SEL_Msk) >> RCC_CCIPR_I2C3SEL_Pos,0,0) ); 
  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C2EN ) )
       DBG_dump_textvalue("I2C2 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_I2C2SEL_Msk) >> RCC_CCIPR_I2C2SEL_Pos,0,0) ); 
  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C1EN ) )
       DBG_dump_textvalue("I2C1 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_I2C1SEL_Msk) >> RCC_CCIPR_I2C1SEL_Pos,0,0) ); 
  if ( READ_BIT(RCC->APB1ENR2, RCC_APB1ENR2_LPUART1EN ) )
       DBG_dump_textvalue("LPUART1 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_LPUART1SEL_Msk) >> RCC_CCIPR_LPUART1SEL_Pos,1,0) ); 
  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART5EN ) )
       DBG_dump_textvalue("UART5 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_UART5SEL_Msk) >> RCC_CCIPR_UART5SEL_Pos,1,0) ); 
  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART4EN ) )
       DBG_dump_textvalue("UART4 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_UART4SEL_Msk) >> RCC_CCIPR_UART4SEL_Pos,1,0) ); 
  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART3EN ) )
       DBG_dump_textvalue("USART3 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_USART3SEL_Msk) >> RCC_CCIPR_USART3SEL_Pos,1,0) ); 
  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART2EN ) )
       DBG_dump_textvalue("USART2 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_USART2SEL_Msk) >> RCC_CCIPR_USART2SEL_Pos,1,0) ); 
  if ( READ_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN ) )
       DBG_dump_textvalue("USART1 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_USART1SEL_Msk) >> RCC_CCIPR_USART1SEL_Pos,1,0) ); 

  DBG_setIndentAbs(oldIndent);
}

void DBG_dump_rtcclockconfig(void)
{
  DEBUG_PUTS("Peripheral clock configuration ------------------" );
  int oldIndent = DBG_setIndentRel(+2);
  DBG_setPadLen(18);

  DBG_printf_indent("Not implemented yet");

  DBG_setIndentAbs(oldIndent);
}

#endif // #if DEBUG_FEATURES > 0

/**
  * @}
  */
